app/controllers/users_controller.rb

INSERT INTO "users" ("b_day", "created_at", "img", "lname", "n_id", "name", "rol", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["b_day", "2014-11-07"], ["created_at", "2014-11-07 18:51:43.928566"], ["img", ""], ["lname", ""], ["n_id", ""], ["name", ""], ["rol", ""], ["updated_at", "2014-11-07 18:51:43.928566"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save